<template>
  <div class="container">
    <Card id="1" info="أفضل الذكر بعد القرآن الكريم">
      لا إله إلا الله
    </Card>
    <Card id="2" info="قال الله تبارك وتعالى يا ابن آدم إنك ما دعوتني ورجوتني غفرت لك على ما كان فيك ولا أبالي يا ابن آدم لو بلغت ذنوبك عنان السماء ثم استغفرتني غفرت لك ولا أبالي يا ابن آدم إنك لو أتيتني بقراب الأرض خطايا ثم لقيتني لا تشرك بي شيئا لأتيتك بقرابها مغفرة">
      أستغفر الله
    </Card>
    <Card id="3" info="من قال سبحان الله وبحمده في يوم مائة مرة حطت خطاياه وإن كانت مثل زبد البحر">
      سبحان الله وبحمده
    </Card>
    <Card id="4" info="تملأ الميزان">
      الحمد لله
    </Card>
    <Card id="5" info="كتبت له عشرون حسنة وحطت عنه عشرون سيئة">
      الله أكبر
    </Card>
    <Card id="6" info="من صلى علي صلاة واحدة صلى الله عليه عشر صلوات وحطت عنه عشر خطيئات ورفعت له عشر درجات">
      اللهم صل وسلم وبارك على سيدنا محمد
    </Card>
    <Card id="7" info="تملآن ما بين السماوات والأرض">
      سبحان الله والحمد لله
    </Card>
    <Card id="8" info="كنز من كنوز الجنة">
      لا حول ولا قوة إلا بالله
    </Card>
    <Card id="9" info="كلمتان خفيفتان على اللسان ثقيلتان في الميزان حبيبتان إلى الرحمن">
      سبحان الله وبحمده سبحان الله العظيم
    </Card>
    <Card id="10" info="من قالها في يوم مئة مرة كانت له عدل عشر رقاب و كتبت له مئة حسنة و محيت عنه مئة سيئة و كانت له حرزًا من الشيطان يومه ذلك حتى يمسي و لم يأت أحد بأفضل مما جاء به الا رجل عمل أكثر منه">
      لا إله إلا الله وحده لا شريك له، له الملك و له الحمد وهو على كل شئ قدير
    </Card>
    <Card id="11" info="أحب الكلام إلى الله ومكفرات للذنوب وغرس الجنة وجُنة لقائلهن من النار وأحب إلى النبي ﷺ مما طلعت عليه الشمس والباقيات الصالحات">
      سبحان الله والحمد لله ولا إله إلا الله والله أكبر
    </Card>
    <Card id="12" info="قال النبي ﷺ عجبت لها فُتحت لها أبواب السماء">
      الله أكبر كبيرا والحمد لله كثيرا وسبحان الله بكرة وأصيلا
    </Card>
    <Card id="13" info="قال النبي ﷺ لقد رأيت اثني عشر ملكًا يبتدرونها أيهم يرفعها">
      الحمد لله حمدًا كثيرًا طيبًا مباركًا فيه
    </Card>
    <div class="error">
      <a href="https://wa.me/+201030740274">
        <i class="fi fi-brands-whatsapp"></i>
      </a>
      <a href="https://github.com/mahmoud-26">
        <i class="fi fi-brands-github"></i>
      </a>
      <a href="mailto:mnaggar2006@gmail.com">
        <i class="fi fi-rr-envelope"></i>
      </a>
    </div>
  </div>
</template>

<script>
  import Card from './components/Card.vue'
  
  export default {
    components: { Card }
  }
</script>

<style scoped>
  .error {
    padding-top: 2em;
    display: flex;
    justify-content: space-evenly;
  }
  .error a {
    font-size: 1.25em;
    color: lightgray;
    text-decoration: none;
  }
  .error a:active {
    color: black;
  }
</style>